// Группировка рекомендуемых точек подачи на прямой

// Ограничение времени	1 секунда
// Ограничение памяти	64Mb
// Ввод	стандартный ввод или input.txt
// Вывод	стандартный вывод или output.txt
// На улицу Льва Толстого заказали такси N раз. Известны точки на улице, куда подъехали водители. Назовём их точками прибытия.
// Приложение запоминает точки прибытия и на их основе просчитывает рекомендуемые точки подачи. Точки подачи нужны, чтобы приложение порекомендовало пользователю, куда лучше заказать автомобиль.
// Сформируйте из точек прибытия на улице Льва Толстого наименьшее количество рекомендуемых точек подачи. Каждая рекомендуемая точка должна быть одной из списка точек прибытия. Расстояние от каждой точки прибытия до ближайшей рекомендуемой не должно превосходить R.
// Формат ввода

// В первой строке задаётся два числа N (0 ≤ N ≤ 105) и R (0 ≤ R ≤ 109) через пробел. В следующей строке записано N целых чисел (координаты точек), каждое из которых по абсолютной величине не превосходит 109.
// Формат вывода

// Выведите одно целое число - какое наименьшее количество точек надо выбрать в качестве рекомендуемых точек подачи.
// Пример 1

// Ввод	Вывод
// 3 2
// 3 5 1
// 1
// Пример 2

// Ввод	Вывод
// 3 2
// 4 7 1
// 3
// Пример 3

// Ввод	Вывод
// 6 1
// 6 2 4 3 5 1